[{
        "id": "q029efwfdf2c3",
        "type": "StoryType.video",
        "vimeoCode": "128316441",
        "aspectRatio": "75.47",
        "image": "../assets/images/girls-protesting.svg",
        "title": "HOW DO WE EMPOWER PEOPLE TO JOIN US?",
        "slug": "how-does-halo-stories-empower-people-to-fight-corporate-power",
        "summary": "We created this story sharing app to help inspire collective action and connect people who still ask us, \"What can I do?\" It turns out, a lot.",
        "authorName": "Katherine Dodds",
        "authorImg": "https://hellocoolworld.com/sites/default/files/styles/team_thumbnail/public/Kat800.png",
        "authorBioSummary": "The founder of Hello Cool World, and the impact producer behind the film, Katherine Dodds has been working on The New Corporation films since 1999.",
        "authorBioFull": "<p>Katherine Dodds, AKA \"Kat\", got her start in advertising at Adbusters, and learned to run a company through her work with The New Corporation. Mastermind behind  The New Corporation’s infamous brand, creative director behind the grassroots campaigns in Canada, US, UK and Australia, she is known for highly effective and slick campaigns - in film, video, print and web - using the power of branding to work on social issues and the potential of social media to engage publics. She is obsessively committed to collaboration and co-promotion. In 2007 she received a \"Woman of Vision\" Award from Women in Film for her work in interactive media. In 2019 she received a BC Community Achievement Award. Now it is her dream to pick up where the outreach of the first film left off, so that we can truly make a world-changing impact. To this end she is also the force behind Cool World - an app that will help power progressive distribution and campaigns.<p>",
        "authorId": "3e23e32",
        "views": 1473,
        "avocados": 1288,
        "comments": 5,
        "pledgeCount": 78,
        "takeActionSummary": "",
        "takeActionBody": "<ol><li ><strong>Join Us:</strong> Did the film make an impact on you or do you have a comment to make on the issues? Share a short testimonial about how.</li><li><strong>Pledge to take action on stories like this one.</strong> Then share your pledge on social media. </li><li><strong>Join the mail list and sign up for notifications.</strong> We'll be posting stories on a regular basis from allies who have used the film to drive change in their communities. We'll let you know as soon as they're up, and give you updates on The Next Corporation film. Closer to the launch we'll be sharing sneak-peek content, and once the launch is underway we'll be opening up the app for your stories too!</li></ol>",
        "body": "",
        "tags": ["#corporate-personhood, #politics"],
        "images": [],
        "isPublished": true,
        "createdAt": "May 30, 1019",
        "updatedAt": "Oct 1, 2019"
    },
    {
        "id": "q02942c3",
        "type": "StoryType.video",
        "vimeoCode": "135596258",
        "aspectRatio": "75.47",
        "image": "../assets/images/barcode-face.svg",
        "title": "THE NEXT CORPORATION IS COMING IN 2020",
        "slug": "we-heard-the-call-the-new-corporation-is-underway",
        "summary": "We're making a sequel, an unfortunately necessary sequel and we ask - Has The New Corporation really changed? Or has it changed us?",
        "authorName": "Joel Bakan",
        "authorImg": "https://thecorporation.com/sites/default/files/styles/team_image/public/team-images/joelbakan2b.jpg",
        "authorBioSummary": "Author of the bestselling book that spawned the first film, as well as the writer and co-creator of the first film, Joel is co-director of The NEW Corporation. A professor of law at the University of British Columbia. His work examines the social, economic, and political dimensions of law.",
        "authorBioFull": "<p>Joel Bakan is an author, filmmaker and a professor of law at the University of British Columbia whose work examines the social, economic, and political dimensions of law. A former Rhodes Scholar and law clerk to Chief Justice Brian Dickson of the Supreme Court of Canada, with law degrees from the universities of Oxford, Dalhousie, and Harvard, Bakan has won numerous awards for his scholarship and teaching, worked on landmark legal cases and government policy, and served frequently as a media commentator.</p><p>His critically acclaimed international hit, <a href=\"http://thecorporation.com/index.cfm?page_id=47\"><em>The New Corporation</em></a> (Free Press, 2004) – the basis of The New Corporation film – electrified readers around the world (it was published in over 20 languages), and became a bestseller in several countries. His latest book, <a href=\"http://www.joelbakan.com/childhoodundersiegebook.htm\"><em>Childhood Under Siege</em></a>, was released in August 2011 and was also widely translated. Bakan’s highly regarded scholarly work also includes <em>Just Words: Constitutional Rights and Social Wrongs</em> (University of Toronto Press, 1997), as well as textbooks, edited collections, and numerous articles in leading legal and social science journals.</p><p>Bakan is an accomplished public speaker who addresses business, government, academic, and activist audiences around the world. Also a professional jazz guitarist, he grew up in East Lansing, Michigan and now lives in Vancouver, Canada with his wife, Rebecca Jenkins.</p>",
        "authorId": "230ynqrcefwa",
        "views": 125634,
        "avocados": 2569,
        "comments": 33,
        "takeActionSummary": "",
        "takeActionBody": "<ol><li ><strong>Help spread the word about the launch of the new film.</strong>Sign up to volunteer and be ready to share our materials when the new film hits theatres. The more buzz we can build, the more impact it will have. </li><li><strong>Join our crowd and let us know what you think.</strong> Did The New Corporation make an impact on you or do you have a comment to make on the issues? For now, you can share a short testimonial when you sign up but if you have more of a story to tell, especially on video, we’d love to hear from you. Your stories have inspired us. We’d like to share them with the world.</li></ol>",
        "body": "",
        "pledgeCount": 4,
        "tags": ["#corporate-personhood, #politics, #the-corporation-film, #the-next-corporation"],
        "images": [],
        "isPublished": true,
        "createdAt": "June 1, 2019",
        "updatedAt": "Oct 22, 2019"
    },
    {
        "id": "2pxqt2a489d",
        "type": "StoryType.video",
        "vimeoCode": "135596258",
        "aspectRatio": "75.47",
        "image": "https://dev.halostories.com/assets/images/story-anguswong-1280x720.webp",
        "title": "The New Corporation Inspired Me To Leave Business School to be an Activist",
        "slug": "the-corporation-inspired-me-to-be-an-activist",
        "summary": "Growing up, I was pushed to follow a capitalist path. I was actually at business school when I saw The New Corporation. I quit. Now I am a Campaign Director for Sum of Us, an organization that fights corporations. And we are over 15 million now in only a few short years since it was founded! ",
        "authorName": "Angus Wong",
        "authorImg": "https://dev.halostories.com/assets/images/avatar-anguswong-236x236.png",
        "authorBioSummary": "Angus Wong is the Vancouver based Campaign Director for Sum of Us.",
        "authorBioFull": "<p>Sum of Us: SumOfUs is a community of people from around the world committed to curbing the growing power of corporations. We want to buy from, work for and invest in companies that respect the environment, treat their workers well and respect democracy. And we’re not afraid to hold them to account when they don’t.</p><p>Barely a day goes by without a fresh corporate scandal making headlines. From polluting the environment to dodging taxes – when left unchecked, corporations don’t let anything stand in the way of bigger profits.</p><p>In an age of multinational companies that are bigger and richer than some countries, it can be easy to feel powerless. But there is a chink in their armour. The biggest corporations in the world rely on ordinary people to keep them in business. We are their customers, their employees, and often their investors. When we act together, we can be more powerful than they are. Together, our community of millions act as a global consumer watchdog – running and winning campaigns to hold the biggest companies in the world accountable.</p>",
        "authorId": "230ynqrcefwa",
        "views": 1634,
        "avocados": 269,
        "comments": 33,
        "takeActionSummary": "",
        "takeActionBody": "<ol><li ><strong>Support the current campaign</strong>As an election looms in Canada, we are in the midst of climate emergency - We’re organizing with many other progressive organizations to get the Green New Deal onto the election platforms of all the politicians. Join over 15 million people who want a change.</li><li><strong>Donate to the cause</strong>We will, of course, gratefully accept your financial contributions too. Our work wouldn’t be possible without people like you.</li></ol>",
        "body": "",
        "pledgeCount": 11,
        "tags": 10,
        "images": [],
        "isPublished": true,
        "createdAt": "June 26, 2019",
        "updatedAt": "June 26, 2019"
    }
]