[{
    "id": "0b37adde9f",
    "type": "StoryType.video",
    "vimeoCode": "378070147",
    "aspectRatio": "75.47",
    "image": "https://dev.thenewcorporation.app/assets/images/story-anguswong-1280x720.png",
    "title": "The New Corporation Inspired Me To Leave Business School to be an Activist",
    "slug": "the-corporation-inspired-me-to-be-an-activist",
    "summary": "Growing up, I was pushed to follow a capitalist path. I was actually at business school when I saw The New Corporation. I quit. Now I am a Campaign Director for Sum of Us, an organization that fights corporations. And we are over 15 million now in only a few short years since it was founded!",
    "authorName": "Angus Wong",
    "authorImg": "https://dev.thenewcorporation.app/assets/images/avatar-anguswong-236x236.png",
    "authorBioSummary": "Angus Wong is the Vancouver based Campaign Director for Sum of Us.",
    "authorBioFull": "<p>Sum of Us: SumOfUs is a community of people from around the world committed to curbing the growing power of corporations. We want to buy from, work for and invest in companies that respect the environment, treat their workers well and respect democracy. And we’re not afraid to hold them to account when they don’t.</p><p>Barely a day goes by without a fresh corporate scandal making headlines. From polluting the environment to dodging taxes – when left unchecked, corporations don’t let anything stand in the way of bigger profits.</p><p>In an age of multinational companies that are bigger and richer than some countries, it can be easy to feel powerless. But there is a chink in their armour. The biggest corporations in the world rely on ordinary people to keep them in business. We are their customers, their employees, and often their investors. When we act together, we can be more powerful than they are. Together, our community of millions act as a global consumer watchdog – running and winning campaigns to hold the biggest companies in the world accountable.</p>",
    "authorId": "230ynqrcefwa",
    "views": 1634,
    "avocados": 269,
    "comments": 33,
    "takeActionSummary": "",
    "takeActionBody": "<ol><li ><strong>Support the current campaign</strong>As an election looms in Canada, we are in the midst of climate emergency - We’re organizing with many other progressive organizations to get the Green New Deal onto the election platforms of all the politicians. Join over 15 million people who want a change.</li><li><strong>Donate to the cause</strong>We will, of course, gratefully accept your financial contributions too. Our work wouldn’t be possible without people like you.</li></ol>",
    "body": "",
    "pledgeCount": 11,
    "tags": 10,
    "images": [],
    "isPublished": true,
    "createdAt": "June 15, 2020",
    "updatedAt": "June 15, 2020"
}]